---
title: Profile
classe: Autodesk.Revit.DB.Profile
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.GeometryObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# Profile

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `CurveArray Curves { get; }` | `profile.Curves` | CurveArray |
| `Boolean Filled { get; set; }` | `profile.Filled` | Boolean |
| `Profile Transformed { get; }` | `profile.Transformed` | Profile |
| `Profile Clone()` | `profile.Clone()` | Profile |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```